zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_h7.c
#if defined(CONFIG_CPU_CORTEX_M7)
#if STM32_D1CPRE > 1
/*
 * D1CPRE prescaler allows to set a HCLK frequency lower than SYSCLK frequency.
 * Though, zephyr doesn't make a difference today between these two clocks.
 * So, changing this prescaler is not allowed until it is made possible to
 * use them independently in zephyr clock subsystem.
 */
#error "D1CPRE prescaler can't be higher than 1"
#endif
#endif /* CONFIG_CPU_CORTEX_M7 */

#if defined(CONFIG_CPU_CORTEX_M7)
/* Offset to access bus clock registers from M7 (or only) core */
#define STM32H7_BUS_CLK_REG	DT_REG_ADDR(DT_NODELABEL(rcc))
#elif defined(CONFIG_CPU_CORTEX_M4)
/* Offset to access bus clock registers from M4 core */
#define STM32H7_BUS_CLK_REG	DT_REG_ADDR(DT_NODELABEL(rcc)) + 0x60
#endif

#if IS_ENABLED(STM32_PLL_P_ENABLED)
BUILD_ASSERT(((STM32_PLL_P_DIVISOR == 1) || (STM32_PLL_P_DIVISOR % 2) == 0),
	     "STM32H7/H7RS PLL1 DIVP divisor factor must be 1 or even");
#endif /* STM32_PLL_P_ENABLED */

static uint32_t get_bus_clock(uint32_t clock, uint32_t prescaler)
{
	return clock / prescaler;
}

__unused
static uint32_t get_pllout_frequency(uint32_t pllsrc_freq,
				     unsigned int pllm_div,
				     unsigned int plln_mul,
				     unsigned int plln_frac,
				     unsigned int pllout_div)
{
	uint64_t plln_mul_u64 = plln_mul;

	__ASSERT_NO_MSG(pllm_div != 0 && pllout_div != 0);

	return PLLX_OUT_FREQ(pllsrc_freq, pllm_div, plln_mul_u64, plln_frac, pllout_div);
}

__unused
static uint32_t get_pllsrc_frequency(void)
{
/* M4 is not expected to call this function */
#ifdef CONFIG_CPU_CORTEX_M7
	return PLLSRC_FREQ;
#else
	return 0;
#endif
}

__unused
static uint32_t get_startup_hclk_frequency(void)
{
	uint32_t sysclk = 0;

	switch (LL_RCC_GetSysClkSource()) {
	case LL_RCC_SYS_CLKSOURCE_STATUS_CSI:
		sysclk = STM32_CSI_FREQ;
		break;
	case LL_RCC_SYS_CLKSOURCE_STATUS_HSI:
		/* Use HAL define instead of STM32_HSI_FREQ, which can be 0 when node is disabled */
		sysclk = HSI_VALUE;
		break;
	case LL_RCC_SYS_CLKSOURCE_STATUS_HSE:
		sysclk = STM32_HSE_FREQ;
		break;
	case LL_RCC_SYS_CLKSOURCE_STATUS_PLL1:
#ifdef CONFIG_BOOTLOADER_MCUBOOT
		/* When using a bootloader, we can't rely on the #define values as the bootloader
		 * may have configured the clock tree differently. Instead, we must read the actual
		 * clock configuration from the RCC registers to determine the current HCLK
		 * frequency.
		 */
		return HAL_RCC_GetHCLKFreq();
#else
		sysclk = get_pllsrc_frequency();
		break;
#endif
	default:
		__ASSERT(0, "Unexpected startup freq");
		return 0;
	}

	return sysclk / STM32_HPRE;
}

static uint32_t get_sysclk_frequency(void)
{
#if defined(STM32_SYSCLK_SRC_PLL)
	return get_pllout_frequency(get_pllsrc_frequency(),
				    STM32_PLL_M_DIVISOR,
				    STM32_PLL_N_MULTIPLIER,
				    STM32_PLL_FRACN_VALUE,
				    STM32_PLL_R_DIVISOR);
#elif defined(STM32_SYSCLK_SRC_CSI)
	return STM32_CSI_FREQ;
#elif defined(STM32_SYSCLK_SRC_HSE)
	return STM32_HSE_FREQ;
#elif defined(STM32_SYSCLK_SRC_HSI)
	return STM32_HSI_FREQ;
#else
	__ASSERT(0, "No SYSCLK Source configured");
	return 0;
#endif
}

#if !defined(CONFIG_CPU_CORTEX_M4)

static int32_t prepare_regulator_voltage_scale(void)
{
	/* Put the CPU in the highest voltage scale supported by the board */
#if defined(CONFIG_SOC_SERIES_STM32H7RSX)
	/* VOS0 is always safe to use on STM32H7RS */
	LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE0);
	while (LL_PWR_IsActiveFlag_VOSRDY() == 0) {
	}
#elif defined(SYSCFG_PWRCR_ODEN)
	/*
	 * On STM32H74x/H75x lines, VOS0 is the overdrive scale entered by
	 * setting SYSCFG_PWRCR.ODEN, and is only valid when Vcore is generated
	 * by the LDO (H7 Data Sheets; stm32h7xx_hal_pwr.h). Other supply modes
	 * (e.g. SMPS-direct, LDO off) are limited to VOS1.
	 */
	if (DT_ENUM_HAS_VALUE(PWRC_NODE, power_supply, ldo) ||
	    DT_ENUM_HAS_VALUE(PWRC_NODE, power_supply, smps_ldo) ||
	    DT_ENUM_HAS_VALUE(PWRC_NODE, power_supply, smps_ext_ldo)) {
		/* Enable the SYSCFG clock so the ODEN write takes effect. */
		LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_SYSCFG);
		__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);
	} else {
		__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
	}

	while (LL_PWR_IsActiveFlag_VOS() == 0) {
	}
#else
	/* On other STM32H7 lines VOS0 does not use ODEN and is always safe */
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);
	while (LL_PWR_IsActiveFlag_VOS() == 0) {
	}
#endif

	return 0;
}

static int32_t optimize_regulator_voltage_scale(uint32_t sysclk_freq)
{

	/* After sysclock is configured, tweak the voltage scale down */
	/* to reduce power consumption */

	/* Needs some smart work to configure properly */
	/* LL_PWR_REGULATOR_SCALE3 is lowest power consumption */
	/* Must be done in accordance to the Maximum allowed frequency vs VOS*/
	/* See RM0433 page 352 for more details */
	LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE0);
#if defined(CONFIG_SOC_SERIES_STM32H7RSX)
	while (LL_PWR_IsActiveFlag_VOSRDY() == 0) {
#else
	while (LL_PWR_IsActiveFlag_VOS() == 0) {
#endif
	};

	return 0;
}

__unused
static int get_vco_input_range(uint32_t m_div, uint32_t *range)
{
	uint32_t vco_freq;

	vco_freq = PLLSRC_FREQ / m_div;

	if (MHZ(1) <= vco_freq && vco_freq <= MHZ(2)) {
		*range = LL_RCC_PLLINPUTRANGE_1_2;
	} else if (MHZ(2) < vco_freq && vco_freq <= MHZ(4)) {
		*range = LL_RCC_PLLINPUTRANGE_2_4;
	} else if (MHZ(4) < vco_freq && vco_freq <= MHZ(8)) {
		*range = LL_RCC_PLLINPUTRANGE_4_8;
	} else if (MHZ(8) < vco_freq && vco_freq <= MHZ(16)) {
		*range = LL_RCC_PLLINPUTRANGE_8_16;
	} else {
		return -ERANGE;
	}

	return 0;
}

/*
 * Select the PLL VCO output range (PLLxVCOSEL). Per RM0433 the medium range
 * spans 150-420 MHz and the wide range spans 192-960 MHz. The range must be
 * chosen from the VCO *output* frequency, not the VCO input range: a 1-2 MHz
 * input can legally drive the VCO above 420 MHz (e.g. M=4, N=480 for a 480 MHz
 * SYSCLK), and selecting the medium range for such a VCO leaves the PLL unable
 * to lock, hanging clock init in the PLL-ready wait loop below. Force the wide
 * range above the medium ceiling and force the medium range below the wide
 * floor; in the 192-420 MHz overlap keep the historical input-range-based
 * choice so existing configurations are unchanged.
 */
__unused
static int get_vco_output_range(uint32_t target_vco_ck, uint32_t *range)
{
	if (IN_RANGE(target_vco_ck, MHZ(150), MHZ(420))) {
		/* Prefer VCOL if possible (for power consumption) */
		*range = LL_RCC_PLLVCORANGE_MEDIUM;
		return 0;
	}

	if (IN_RANGE(target_vco_ck, MHZ(192), MHZ(960))) {
		*range = LL_RCC_PLLVCORANGE_WIDE;
		return 0;
	}

	return -ERANGE;
}

#endif /* ! CONFIG_CPU_CORTEX_M4 */

/** @brief Verifies clock is part of active clock configuration */
int enabled_clock(uint32_t src_clk)
{

